## Loading Packages

In [1]:
import pandas as pd

## Reading Data

In [2]:
books = pd.read_csv('data/BX_Books.csv', sep=';', encoding='latin-1',low_memory=False)
ratings = pd.read_csv('data/BX-Book-Ratings.csv', sep=';', encoding='latin-1',low_memory=False)
users = pd.read_csv('data/BX-Users.csv', sep=';', encoding='latin-1',low_memory=False)

## Having A Look At The Data

In [3]:
users.head(10)

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN
5        6       santa monica, california, usa  61.0
6        7                 washington, dc, usa   NaN
7        8            timmins, ontario, canada   NaN
8        9          germantown, tennessee, usa   NaN
9       10          albacete, wisconsin, spain  26.0

In [4]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton & Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [5]:
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

## Data Merging

In [6]:
df=pd.merge(users,ratings,on='User-ID')
df=pd.merge(books,df,on='ISBN')

In [7]:
df.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L,User-ID,Location,Age,Book-Rating
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,2,"stockton, california, usa",18.0,0
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,8,"timmins, ontario, canada",NaN,5
2,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,11400,"ottawa, ontario, canada",49.0,0
3,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,11676,"n/a, n/a, n/a",NaN,8
4,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,41385,"sudbury, ontario, canada",NaN,0

In [8]:
df.shape

(1031175, 12)

In [9]:
df.describe()

       Year-Of-Publication       User-ID            Age   Book-Rating
count         1.031175e+06  1.031175e+06  753330.000000  1.031175e+06
mean          1.968194e+03  1.405944e+05      37.397719  2.839022e+00
std           2.311048e+02  8.052444e+04      14.098189  3.854149e+00
min           0.000000e+00  2.000000e+00       0.000000  0.000000e+00
25%           1.992000e+03  7.041500e+04      28.000000  0.000000e+00
50%           1.997000e+03  1.412100e+05      35.000000  0.000000e+00
75%           2.001000e+03  2.114260e+05      45.000000  7.000000e+00
max           2.050000e+03  2.788540e+05     244.000000  1.000000e+01

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1031175 entries, 0 to 1031174
Data columns (total 12 columns):
 #   Column               Non-Null Count    Dtype
---  ------               --------------    -----
 0   ISBN                 1031175 non-null  object
 1   Book-Title           1031175 non-null  object
 2   Book-Author          1031174 non-null  object
 3   Year-Of-Publication  1031175 non-null  int64
 4   Publisher            1031173 non-null  object
 5   Image-URL-S          1031175 non-null  object
 6   Image-URL-M          1031175 non-null  object
 7   Image-URL-L          1031175 non-null  object
 8   User-ID              1031175 non-null  int64
 9   Location             1031175 non-null  object
 10  Age                  753330 non-null   float64
 11  Book-Rating          1031175 non-null  int64
dtypes: float64(1), int64(3), object(8)
memory usage: 102.3+ MB

## Check For Missing Values

In [11]:
df.isnull().sum()

ISBN                        0
Book-Title                  0
Book-Author                 1
Year-Of-Publication         0
Publisher                   2
Image-URL-S                 0
Image-URL-M                 0
Image-URL-L                 0
User-ID                     0
Location                    0
Age                    277845
Book-Rating                 0
dtype: int64

In [12]:
fix_age = df[df['Age'] > 0]
fix_age = df[df['Age'] < 100]
df['Age'] = df['Age'].fillna(fix_age['Age'].mean())
df.isnull().sum()

df.dropna(inplace=True)

In [13]:
df.isnull().sum()

ISBN                   0
Book-Title             0
Book-Author            0
Year-Of-Publication    0
Publisher              0
Image-URL-S            0
Image-URL-M            0
Image-URL-L            0
User-ID                0
Location               0
Age                    0
Book-Rating            0
dtype: int64

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1031172 entries, 0 to 1031174
Data columns (total 12 columns):
 #   Column               Non-Null Count    Dtype
---  ------               --------------    -----
 0   ISBN                 1031172 non-null  object
 1   Book-Title           1031172 non-null  object
 2   Book-Author          1031172 non-null  object
 3   Year-Of-Publication  1031172 non-null  int64
 4   Publisher            1031172 non-null  object
 5   Image-URL-S          1031172 non-null  object
 6   Image-URL-M          1031172 non-null  object
 7   Image-URL-L          1031172 non-null  object
 8   User-ID              1031172 non-null  int64
 9   Location             1031172 non-null  object
 10  Age                  1031172 non-null  float64
 11  Book-Rating          1031172 non-null  int64
dtypes: float64(1), int64(3), object(8)
memory usage: 102.3+ MB

## Dropping Useless Columns

In [15]:
df.drop(['ISBN','Image-URL-S','Image-URL-M','Image-URL-L','User-ID'],axis=1,inplace=True)
df.head()

,Book-Title,Book-Author,Year-Of-Publication,Publisher,Location,Age,Book-Rating
0,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,"stockton, california, usa",18.000000,0
1,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"timmins, ontario, canada",36.983439,5
2,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"ottawa, ontario, canada",49.000000,0
3,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"n/a, n/a, n/a",36.983439,8
4,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"sudbury, ontario, canada",36.983439,0

## Renaming Columns

In [16]:
df.columns = ['title', 'author', 'yearOf', 'publisher', 'location', 'age', 'rating']
df.head()

,title,author,yearOf,publisher,location,age,rating
0,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,"stockton, california, usa",18.000000,0
1,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"timmins, ontario, canada",36.983439,5
2,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"ottawa, ontario, canada",49.000000,0
3,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"n/a, n/a, n/a",36.983439,8
4,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"sudbury, ontario, canada",36.983439,0

## Changing Datatypes

In [17]:
df['age'] = df['age'].astype(int)

In [18]:
location = df.location.str.split(', ', n=2, expand=True)

df['city'] = location[0]
df['state'] = location[1]
df['country'] = location[2]

In [19]:
df.head()

,title,author,yearOf,publisher,location,age,rating,city,state,country
0,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,"stockton, california, usa",18,0,stockton,california,usa
1,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"timmins, ontario, canada",36,5,timmins,ontario,canada
2,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"ottawa, ontario, canada",49,0,ottawa,ontario,canada
3,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"n/a, n/a, n/a",36,8,n/a,n/a,n/a
4,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,"sudbury, ontario, canada",36,0,sudbury,ontario,canada

In [20]:
df.drop('location',axis=1,inplace=True)
df["city"].fillna("n/a", inplace=True)
df["state"].fillna("n/a", inplace=True)
df["country"].fillna("n/a", inplace=True)

## Removing Useless Info

##### Rating can't be 0

In [21]:
df.drop(index=df[df['rating'] == 0].index, inplace=True)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 383849 entries, 1 to 1031171
Data columns (total 9 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   title      383849 non-null  object
 1   author     383849 non-null  object
 2   yearOf     383849 non-null  int64
 3   publisher  383849 non-null  object
 4   age        383849 non-null  int32
 5   rating     383849 non-null  int64
 6   city       383849 non-null  object
 7   state      383849 non-null  object
 8   country    383849 non-null  object
dtypes: int32(1), int64(2), object(6)
memory usage: 27.8+ MB

##### Age can't be more than 100 and less than 4

In [23]:
df = df[df['age'] < 100]
df = df[df['age'] > 4]

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 382195 entries, 1 to 1031171
Data columns (total 9 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   title      382195 non-null  object
 1   author     382195 non-null  object
 2   yearOf     382195 non-null  int64
 3   publisher  382195 non-null  object
 4   age        382195 non-null  int32
 5   rating     382195 non-null  int64
 6   city       382195 non-null  object
 7   state      382195 non-null  object
 8   country    382195 non-null  object
dtypes: int32(1), int64(2), object(6)
memory usage: 27.7+ MB

##### Year can't be more than 2022 and less than 0

In [25]:
df = df[df['yearOf'] < 2022]
df = df[df['yearOf'] > 0]

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 376435 entries, 1 to 1031171
Data columns (total 9 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   title      376435 non-null  object
 1   author     376435 non-null  object
 2   yearOf     376435 non-null  int64
 3   publisher  376435 non-null  object
 4   age        376435 non-null  int32
 5   rating     376435 non-null  int64
 6   city       376435 non-null  object
 7   state      376435 non-null  object
 8   country    376435 non-null  object
dtypes: int32(1), int64(2), object(6)
memory usage: 27.3+ MB

## Saving Dataset

In [27]:
df.to_csv("data.csv", index=False)